NSCameraUsageDescription = "És necessari accedir a la càmera per escanejar documents i fer fotos i vídeos.";
NSFaceIDUsageDescription = "Face ID is required to authenticate using face recognition.";
NSLocationAlwaysUsageDescription = "The app uses your location to automatically trigger file uploads when you move between areas.";
NSPhotoLibraryUsageDescription = "És necessari accedir a la galeria per poder penjar les teves fotos i vídeos al teu núvol.";
NSPhotoLibraryAddUsageDescription = "És necessari accedir a la galeria per poder penjar les teves fotos i vídeos al teu núvol.";
NSMicrophoneUsageDescription = "És necessari accedir al micròfon per crear notes de veu.";
NSLocationWhenInUseUsageDescription = "This app uses your location to detect movement and automatically upload files. It does not use GPS and does not store your location.";
NSLocationAlwaysAndWhenInUseUsageDescription = "This app needs access to your location even in the background to automatically start uploading files when significant movement is detected. GPS is not used.";
